In [1]:
import pandas as pd
p=[ 9, 35, 59, 64, 77, 42, 13, 56, 64]

In [2]:
k=[]
j=[]
for i in range(len(p)):
    if p[i]%2==0:
        k.append(p[i])
    else:
        j.append(p[i])

In [3]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [4]:
pd.Series(p)

0     9
1    35
2    59
3    64
4    77
5    42
6    13
7    56
8    64
dtype: int64

In [5]:
pd.Series(p).mean()

46.55555555555556

In [6]:
pd.Series(p).median()

56.0

In [7]:
pd.Series(p).mode()

0    64
dtype: int64

In [8]:
list(p)

[9, 35, 59, 64, 77, 42, 13, 56, 64]

In [9]:
type(p)

list

In [10]:
q= pd.Series([34,3,2,1,34,32])
q

0    34
1     3
2     2
3     1
4    34
5    32
dtype: int64

In [11]:
p=pd.Series(p)

In [12]:
p+q

0     43.0
1     38.0
2     61.0
3     65.0
4    111.0
5     74.0
6      NaN
7      NaN
8      NaN
dtype: float64

In [13]:
p-q

0   -25.0
1    32.0
2    57.0
3    63.0
4    43.0
5    10.0
6     NaN
7     NaN
8     NaN
dtype: float64

In [14]:
p*q

0     306.0
1     105.0
2     118.0
3      64.0
4    2618.0
5    1344.0
6       NaN
7       NaN
8       NaN
dtype: float64

In [15]:
p/q

0     0.264706
1    11.666667
2    29.500000
3    64.000000
4     2.264706
5     1.312500
6          NaN
7          NaN
8          NaN
dtype: float64

In [16]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)

In [17]:
from sklearn.datasets import load_iris

In [18]:
data= load_iris()

In [19]:
df=pd.concat([df,df,df,df,df],axis=1)
df

,col1,col2,col3,col1,col2,col3,col1,col2,col3,col1,col2,col3,col1,col2,col3
0,1,4,7,1,4,7,1,4,7,1,4,7,1,4,7
1,2,5,5,2,5,5,2,5,5,2,5,5,2,5,5
2,3,6,8,3,6,8,3,6,8,3,6,8,3,6,8
3,4,9,12,4,9,12,4,9,12,4,9,12,4,9,12
4,7,5,1,7,5,1,7,5,1,7,5,1,7,5,1
5,11,0,11,11,0,11,11,0,11,11,0,11,11,0,11

In [20]:
df.col1[0:6]

   col1  col1  col1  col1  col1
0     1     1     1     1     1
1     2     2     2     2     2
2     3     3     3     3     3
3     4     4     4     4     4
4     7     7     7     7     7
5    11    11    11    11    11

In [21]:
import numpy as np

In [22]:
p=p[0:6]
p==q
pd.concat([p,q],axis=1)

    0   1
0   9  34
1  35   3
2  59   2
3  64   1
4  77  34
5  42  32

In [23]:
d={'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
pd.Series(d)

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [24]:
i=np.array(p)
pd.Series(i)

0     9
1    35
2    59
3    64
4    77
5    42
dtype: int64

In [25]:
pd.to_numeric(p)

0     9
1    35
2    59
3    64
4    77
5    42
dtype: int64

In [26]:
#df.loc['col1':'col3']

In [27]:
l=df['col1']
l=pd.Series([l])
l

0       col1  col1  col1  col1  col1
0     1     1 ...
dtype: object

In [28]:
np.array(l)

array([   col1  col1  col1  col1  col1
0     1     1     1     1     1
1     2     2     2     2     2
2     3     3     3     3     3
3     4     4     4     4     4
4     7     7     7     7     7
5    11    11    11    11    11], dtype=object)

In [29]:
j=pd.Series(i)
j.sort_values()

0     9
1    35
5    42
2    59
3    64
4    77
dtype: int64

In [30]:
[j.index[j==j.max()],j.index[j==j.min()]]

[Int64Index([4], dtype='int64'), Int64Index([0], dtype='int64')]

In [31]:
q

0    34
1     3
2     2
3     1
4    34
5    32
dtype: int64

In [32]:
pd.concat([q,j],axis=0)

0    34
1     3
2     2
3     1
4    34
5    32
0     9
1    35
2    59
3    64
4    77
5    42
dtype: int64

In [33]:
x=[34,2,12,34,23]
y=pd.Series(x)
pd.concat([q,y],ignore_index='True')

0     34
1      3
2      2
3      1
4     34
5     32
6     34
7      2
8     12
9     34
10    23
dtype: int64

In [34]:
m=pd.concat([q,y],ignore_index='True')
m[m>20]

0     34
4     34
5     32
6     34
9     34
10    23
dtype: int64

In [35]:
m[m==34]

0    34
4    34
6    34
9    34
dtype: int64

In [36]:
m.reindex([3,4,5,6,7,8,9,1,2,10])

3      1
4     34
5     32
6     34
7      2
8     12
9     34
1      3
2      2
10    23
dtype: int64

In [37]:
m.mean()

19.181818181818183

In [38]:
m.std()

15.138151682541578

In [39]:
m=set(m)
q=set(q)
a=m-q
a=list(a)
a=pd.Series(a)
a

0    12
1    23
dtype: int64

In [40]:
z=np.array([[0,10,20],[20,30,40]])
z[z>10]
np.where(z[z>10])

(array([0, 1, 2, 3], dtype=int64),)

In [41]:
import pandas as pd
df_data = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,75,None,80,86], 'Y':[84,94,89,86,86],'Z':[86,97,96,72,83]});
sr_data = pd.Series([68, 75, 86, 80, None])

In [42]:
h=list(df_data.columns)

In [43]:
for i in range(len(h)):
    k=df_data[h[i]]!=sr_data
    print(pd.DataFrame(k))

       0
0  False
1  False
2  False
3  False
4   True
       0
0   True
1  False
2   True
3  False
4   True
      0
0  True
1  True
2  True
3  True
4  True
      0
0  True
1  True
2  True
3  True
4  True

In [44]:
pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [45]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [46]:
pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},index=labels)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [47]:
DF1= pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},index=labels)

In [48]:
DF1

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [49]:
DF1.iloc[0:6,0:4]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes

In [50]:
DF1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [51]:
DF1.iloc[[0,1,2]]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [52]:
DF1[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [53]:
DF1.loc[['b','d','f','g']][['score','qualify']]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [54]:
DF1.attempts.sum()

19

In [55]:
DF1.iloc[[2,3,4]][['score','qualify']]

   score qualify
c   16.5     yes
d    NaN      no
e    9.0      no

In [56]:
DF1.index.value_counts().sum()

10

In [57]:
DF1.columns.value_counts().sum()

4

In [58]:
DF1.loc[(DF1['score']<20.0)&(DF1['score']>15.0)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes

In [59]:
DF1.loc[DF1['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [60]:
DF1.loc[DF1['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [61]:
DF1.loc[(DF1['attempts']<2)&(DF1['score']>15.0)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [62]:
DF1[3:4]['score']=15.0

<ipython-input-62-c7cf4817fba7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  DF1[3:4]['score']=15.0

In [63]:
DF1.score.mean()

13.722222222222221

In [64]:
#d=pd.DataFrame(('name:''Suresh' ,15.5, 1, 'yes'), index=k)

In [65]:
A=np.array([[1,2,3],[2,3,4]])
B=np.array([[1,2,3],[2,3,4]])
A=A.reshape(6,1)
B=B.reshape(6,1)

In [66]:
#np.vstack((A,B))

In [67]:
import pandas as pd
import csv
data=pd.read_csv('ec.csv')
data

,Unnamed: 0,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_occupation,contb_receipt_amt,contb_receipt_dt,Age,Pstatus_sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,foreign worker
0,61030,"Obama, Barack","KNOX, JAMES",GADSDEN,AL,RETIRED,50.0,28-Nov-11,67,male:single,2,own,No_account,little,1169,6,radio/TV,Yes
1,474870,"Cain, Herman","STOKES, MARION O MR",MARYVILLE,TN,RETIRED,80.0,27-Oct-11,22,female : divorced/separated/married,2,own,little,moderate,5951,48,radio/TV,Yes
2,498731,"Gingrich, Newt","BLAIR, RALPH E. MR.",GUTHRIE,OK,RETIRED,50.0,07-Dec-11,49,male:single,1,own,little,No_account,2096,12,education,Yes
3,155276,"Obama, Barack","LACEWELL, BARBARA",ROSWELL,GA,COLLISION CENTER MANAGER,10.0,31-Oct-11,45,male:single,2,free,little,little,7882,42,furniture/equipment,Yes
4,118843,"Obama, Barack","YBANEZ, VICTORIA",COLORADO SPRINGS,CO,DIRECTOR,120.0,07-Jan-12,53,male:single,2,free,little,little,4870,24,car,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,530141,"Perry, Rick","MOSS, JOHNNY M. MR.",ROCKWALL,TX,INSURANCE,1000.0,09-Sep-11,31,female : divorced/separated/married,1,own,little,No_account,1736,12,furniture/equipment,Yes
996,316424,"Obama, Barack","MOODY, BARBARA",SAN ANTONIO,TX,RETIRED,100.0,29-Dec-11,40,male : divorced/separated,3,own,little,little,3857,30,car,Yes
997,57938,"Romney, Mitt","CASPERSON, GEORGE E. MR.",SAMMAMISH,WA,RETIRED,225.0,20-Jun-11,38,male:single,2,own,little,No_account,804,12,radio/TV,Yes
998,256391,"Obama, Barack","ROBERTS, MATTHEW",NEW YORK,NY,TELEVISION PRODUCER/WRITER,10.0,02-Jun-11,23,male:single,2,free,little,little,1845,45,radio/TV,Yes
999,48588,"Romney, Mitt","ARNOLD, BEVERLY B. MRS.",HOUSTON,TX,HOMEMAKER,500.0,10-Oct-11,27,male:single,2,own,moderate,moderate,4576,45,car,Yes

In [68]:
data.iloc[2:6, 4:10]

,contbr_st,contbr_occupation,contb_receipt_amt,contb_receipt_dt,Age,Pstatus_sex
2,OK,RETIRED,50.0,07-Dec-11,49,male:single
3,GA,COLLISION CENTER MANAGER,10.0,31-Oct-11,45,male:single
4,CO,DIRECTOR,120.0,07-Jan-12,53,male:single
5,MO,RETIRED,100.0,22-Aug-11,35,male:single

In [69]:
DF1.columns.tolist()

['name', 'score', 'attempts', 'qualify']

In [70]:
v=pd.Series(['Suresh', 15.5, 1,'yes'])

In [71]:
v=pd.DataFrame(v).transpose()
v

        0     1  2    3
0  Suresh  15.5  1  yes

In [72]:
v.index=['k']
v.columns=['name','score','attempts','qualify']

In [73]:
DF1.append(v)

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
c  Katherine  16.5        2     yes
d      James    15        3      no
e      Emily     9        2      no
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
j      Jonas    19        1     yes
k     Suresh  15.5        1     yes

In [74]:
DF1=DF1.sort_values('name')
DF1

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   15.0         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

In [75]:
DF1.sort_values('score',inplace=True, ascending=False)

In [76]:
DF1

        name  score  attempts qualify
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
d      James   15.0         3      no
g    Matthew   14.5         1     yes
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
i      Kevin    8.0         2      no
h      Laura    NaN         1      no

In [77]:
DF1['qualify'][DF1['qualify']=='yes']='True'
DF1['qualify'][DF1['qualify']=='no']='False'

<ipython-input-77-94c56e14137d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  DF1['qualify'][DF1['qualify']=='yes']='True'
<ipython-input-77-94c56e14137d>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  DF1['qualify'][DF1['qualify']=='no']='False'

In [78]:
DF1

        name  score  attempts qualify
f    Michael   20.0         3    True
j      Jonas   19.0         1    True
c  Katherine   16.5         2    True
d      James   15.0         3   False
g    Matthew   14.5         1    True
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
e      Emily    9.0         2   False
i      Kevin    8.0         2   False
h      Laura    NaN         1   False

In [79]:
#DF1.drop(15.0, axis=1)

In [80]:
DF1.iloc[3:4,1:2]

   score
d   15.0

In [81]:
DF1['name'][DF1['name']=='James']='suresh'

<ipython-input-81-eb76d7c8c315>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  DF1['name'][DF1['name']=='James']='suresh'

In [82]:
D=pd.DataFrame(data['Pstatus_sex'])
D=list(D['Pstatus_sex'])

In [83]:
K=[]
for i in range(len(D)):
    H=D[i].split(':')
    K.append(H)

In [84]:
Pstatus=[]
sex=[]
for i in range(len(K)):
    l=K[i][:1]
    m=K[i][1:]
    Pstatus.append(m)
    sex.append(l)

In [85]:
data['Pstatus']=pd.DataFrame(data=Pstatus)
data['sex']=pd.DataFrame(data=sex)

In [86]:
data.groupby('sex')['Job'].value_counts()

sex      Job
female   2      197
         1       64
         3       37
         0       12
male     2      340
         1      106
         3       94
         0        8
male     2       62
         1       22
         3        6
         0        2
male     2       31
         3       11
         1        8
Name: Job, dtype: int64

In [87]:
p={'Bachmann, Michelle': 'Republican'
,'Romney, Mitt' : 'Republican'
,'Obama, Barack': 'Democrat'
,"Roemer, Charles E.'Buddy' III": 'Reform'
,'Pawlenty, Timothy': 'Republican'
,'Johnson, Gary Earl': 'Libertarian'
,'Paul, Ron': 'Republican'
,'Santorum, Rick': 'Republican'
,'Cain, Herman': 'Republican'
,'Gingrich, Newt': 'Republican'
,'McCotter, Thaddeus G': 'Republican'
,'Huntsman, Jon': 'Republican'
,'Perry, Rick': 'Republican'}

In [88]:
data['party']=data['cand_nm'].map(p)

In [89]:
j=list(data['cand_nm'])
k=[]
for i in range(len(j)):
    h=j[i].split(',')
    k.append(h)

In [90]:
first_nm=[]
last_nm=[]
for i in range(len(k)):
    l=k[i][:1]
    m=k[i][1:]
    first_nm.append(l)
    last_nm.append(m)

In [91]:
data['first_nm']=pd.DataFrame(data=first_nm)
data['last_nm']=pd.DataFrame(data=last_nm)

In [92]:
data['last_nm'].value_counts()

 Barack                    553
 Ron                       154
 Mitt                      112
 Rick                       46
 Newt                       45
 Herman                     38
 Michelle                   28
 Charles E. 'Buddy' III     10
 Timothy                     6
 Jon                         5
 Gary Earl                   2
 Thaddeus G                  1
Name: last_nm, dtype: int64

In [93]:
data1=data.sort_values('contb_receipt_amt', ascending=False)

In [94]:
data1.groupby('cand_nm')['cand_nm'].value_counts(ascending=False)

cand_nm                         cand_nm
Bachmann, Michelle              Bachmann, Michelle                 28
Cain, Herman                    Cain, Herman                       38
Gingrich, Newt                  Gingrich, Newt                     45
Huntsman, Jon                   Huntsman, Jon                       5
Johnson, Gary Earl              Johnson, Gary Earl                  2
McCotter, Thaddeus G            McCotter, Thaddeus G                1
Obama, Barack                   Obama, Barack                     553
Paul, Ron                       Paul, Ron                         154
Pawlenty, Timothy               Pawlenty, Timothy                   6
Perry, Rick                     Perry, Rick                        30
Roemer, Charles E. 'Buddy' III  Roemer, Charles E. 'Buddy' III     10
Romney, Mitt                    Romney, Mitt                      112
Santorum, Rick                  Santorum, Rick                     16
Name: cand_nm, dtype: int64

In [95]:
l=data1.groupby('cand_nm')['contb_receipt_amt'].sum(ascending=True)

TypeError: sum() got an unexpected keyword argument 'ascending'

In [ ]:
l.sort_values(ascending=False)

In [ ]:
data1[['contbr_nm','contbr_occupation']].head(10)

In [ ]:
a1=data1['contbr_nm'].value_counts().sort_values(ascending=False)

In [ ]:
data1[data1['contbr_nm']=='HONEYWELL, JEFFREY']

In [ ]:
data1[data1['contbr_nm']=='FUQUA, MARY E']

In [96]:
data1.drop([645,153])

,Unnamed: 0,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_occupation,contb_receipt_amt,contb_receipt_dt,Age,Pstatus_sex,...,Checking account,Credit amount,Duration,Purpose,foreign worker,Pstatus,sex,party,first_nm,last_nm
380,4376,"Romney, Mitt","LEMKIN, TODD MR.",LOS ANGELES,CA,ASSET MANAGEMENT,5000.00,18-Nov-11,39,male:single,...,little,2212,20,furniture/equipment,Yes,single,male,Republican,Romney,Mitt
762,17498,"Romney, Mitt","SEGAL, MERTON J. MR.",BOCA RATON,FL,RETIRED,5000.00,27-Jun-11,24,male:single,...,little,2214,12,radio/TV,Yes,single,male,Republican,Romney,Mitt
337,56574,"Romney, Mitt","KILBERG, BOBBIE GREENE MRS.",MCLEAN,VA,PRESIDENT & C.E.O.,5000.00,22-Jun-11,24,female : divorced/separated/married,...,little,1275,15,domestic appliances,Yes,divorced/separated/married,female,Republican,Romney,Mitt
924,359229,"Pawlenty, Timothy","NICHOLS, DANIEL MR.",APPLE VALLEY,MN,MARKETING,5000.00,20-May-11,55,male : divorced/separated,...,little,6872,24,furniture/equipment,Yes,divorced/separated,male,Republican,Pawlenty,Timothy
475,533743,"Perry, Rick","FORBES, SEAN MR.",AUSTIN,TX,PRESIDENT,5000.00,16-Aug-11,26,female : divorced/separated/married,...,little,3114,18,furniture/equipment,Yes,divorced/separated/married,female,Republican,Perry,Rick
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,278916,"Obama, Barack","FUQUA, MARY E",CLEVELAND,OH,HOMEMAKER,-120.00,29-Apr-11,24,male:single,...,little,4605,48,car,Yes,single,male,Democrat,Obama,Barack
860,278517,"Obama, Barack","OBRIEN, DENISE",GATES MILLS,OH,NaN,-229.00,17-Aug-11,27,male:single,...,No_account,5804,24,car,Yes,single,male,Democrat,Obama,Barack
825,336205,"Obama, Barack","APPEL, WILLIAM",WALDRON,WA,NaN,-300.00,22-Sep-11,30,male : married/widowed,...,little,1602,21,car,Yes,married/widowed,male,Democrat,Obama,Barack
69,50470,"Romney, Mitt","BURT, KRIS",WOODS CROSS,UT,NaN,-457.33,09-Jan-12,25,female : divorced/separated/married,...,No_account,2394,36,radio/TV,Yes,divorced/separated/married,female,Republican,Romney,Mitt
250,226069,"Obama, Barack","ELLIS, JAMES B. MR.",LEES SUMMIT,MO,NaN,-1250.00,20-Jan-12,39,female : divorced/separated/married,...,little,666,6,car,Yes,divorced/separated/married,female,Democrat,Obama,Barack

In [97]:
data2=data[data['party']=='Democrat']
data2.sort_values('contb_receipt_amt',ascending=False).head(10)

,Unnamed: 0,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_occupation,contb_receipt_amt,contb_receipt_dt,Age,Pstatus_sex,...,Checking account,Credit amount,Duration,Purpose,foreign worker,Pstatus,sex,party,first_nm,last_nm
183,128645,"Obama, Barack","TRUDEAU, GARRY B",BRANFORD,CT,CARTOONIST,2500.0,16-Sep-11,50,male:single,...,No_account,3777,24,furniture/equipment,Yes,single,male,Democrat,Obama,Barack
985,349335,"Obama, Barack","GENGLER, MICHAEL",MONTICELLO,WI,ATTORNEY,2500.0,17-Jun-11,25,female : divorced/separated/married,...,little,1433,15,furniture/equipment,Yes,divorced/separated/married,female,Democrat,Obama,Barack
392,307295,"Obama, Barack","LOPEZ, WENDY",DALLAS,TX,ENGINEER,2500.0,19-Sep-11,39,male:single,...,little,3249,36,car,Yes,single,male,Democrat,Obama,Barack
45,133616,"Obama, Barack","WILLIAMS, ELIZABETH H",WASHINGTON,DC,PUBLIC HEALTH SPECIALIST,2500.0,24-May-11,35,female : divorced/separated/married,...,No_account,1393,11,car,Yes,divorced/separated/married,female,Democrat,Obama,Barack
97,198096,"Obama, Barack","MEELIA, RICHARD J.",WALPOLE,MA,CHAIRMAN/PRESIDENT/CEO,2500.0,06-May-11,34,male:single,...,moderate,2622,18,business,Yes,single,male,Democrat,Obama,Barack
52,177395,"Obama, Barack","HAMMES, LINDA",GLENCOE,IL,GALLERIST,2500.0,04-Jan-12,25,male:single,...,No_account,1262,12,radio/TV,Yes,single,male,Democrat,Obama,Barack
984,91225,"Obama, Barack","WOOD, JACKIE",MENLO PARK,CA,RETIRED,2500.0,30-Nov-11,30,male:single,...,No_account,2028,24,furniture/equipment,Yes,single,male,Democrat,Obama,Barack
439,165790,"Obama, Barack","ROGERS, JOHN W JR.",CHICAGO,IL,CHAIRMAN,2500.0,08-Apr-11,26,female : divorced/separated/married,...,rich,609,12,business,Yes,divorced/separated/married,female,Democrat,Obama,Barack
733,253273,"Obama, Barack","CLAYTON, ANNIE",NEW YORK,NY,HOMEMAKER,2500.0,30-Aug-11,28,female : divorced/separated/married,...,No_account,2603,24,car,Yes,divorced/separated/married,female,Democrat,Obama,Barack
286,203320,"Obama, Barack","LAMPERT, MARK",BETHESDA,MD,AUDIO DIRECTOR,2500.0,21-Jun-11,26,male:single,...,little,4788,48,car,Yes,single,male,Democrat,Obama,Barack

In [98]:
data2['contbr_city'].value_counts()

NEW YORK         25
CHICAGO          16
WASHINGTON       14
LOS ANGELES       8
CAMBRIDGE         6
                 ..
ALEXANDRIA        1
SPOKANE           1
DAYTONA BEACH     1
WHEAT RIDGE       1
GLASTONBURY       1
Name: contbr_city, Length: 373, dtype: int64

In [99]:
data2[data2['contbr_city']=='NEW YORK']['contb_receipt_amt'].sum()

13150.0

In [100]:
h=data1.groupby('cand_nm')
h['cand_nm'].value_counts()

cand_nm                         cand_nm
Bachmann, Michelle              Bachmann, Michelle                 28
Cain, Herman                    Cain, Herman                       38
Gingrich, Newt                  Gingrich, Newt                     45
Huntsman, Jon                   Huntsman, Jon                       5
Johnson, Gary Earl              Johnson, Gary Earl                  2
McCotter, Thaddeus G            McCotter, Thaddeus G                1
Obama, Barack                   Obama, Barack                     553
Paul, Ron                       Paul, Ron                         154
Pawlenty, Timothy               Pawlenty, Timothy                   6
Perry, Rick                     Perry, Rick                        30
Roemer, Charles E. 'Buddy' III  Roemer, Charles E. 'Buddy' III     10
Romney, Mitt                    Romney, Mitt                      112
Santorum, Rick                  Santorum, Rick                     16
Name: cand_nm, dtype: int64

In [101]:
k=data1.groupby(['cand_nm'])
k['contbr_st'].value_counts()

cand_nm             contbr_st
Bachmann, Michelle  TX           4
                    CA           3
                    FL           3
                    MI           3
                    MN           2
                                ..
Santorum, Rick      LA           1
                    MI           1
                    NE           1
                    NJ           1
                    TN           1
Name: contbr_st, Length: 231, dtype: int64

In [102]:
g=pd.read_csv('A.csv')
import numpy as np
np.recfromcsv('A.csv')

rec.array([(1.000e+00,), (2.000e+00,), (3.000e+00,), ..., (1.997e+03,),
           (1.998e+03,), (1.999e+03,)],
          dtype=[('0000000000000000000e00', '<f8')])

In [103]:
n=int(input('enter the number'))
m=int(input('enter 2nd number'))
a=int(input('enter the max limit'))
z=[n,m]
for i in range(a):
    v=m+n
    z.append(v)
    n=m
    m=v
print(z)

enter the number2
enter 2nd number10
enter the max limit20
[2, 10, 12, 22, 34, 56, 90, 146, 236, 382, 618, 1000, 1618, 2618, 4236, 6854, 11090, 17944, 29034, 46978, 76012, 122990]

In [104]:
import numpy as np
n1=int(input('enter the no'))
n2=np.arange(1,n1,1)
n3=np.product(n2)
fact=n1*n3

enter the no4

In [105]:
a1=np.random.randint(1,34,20)
a1=a1.reshape(4,5)
a2=pd.DataFrame(a1)
a2

    0   1   2   3   4
0   6  19  15  24   4
1   2  17  17  28  21
2  29  32  13  17  19
3  20  28  24  13  14

In [106]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
for i in range(len(pos)):
    ser1=ser[pos]
    
ser1

0     a
4     e
8     i
14    o
20    u
dtype: object

In [107]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.rand(10)
ms=[]
for i in range(len(truth)):
    ms.append(np.sqrt(truth[i]**2+pred[i]**2))
ms=pd.Series(ms).sum()
ms

67.06848403782652

In [108]:
n1=np.array([[1,2,3,4],[6,7,8,9]])

In [109]:
n1

array([[1, 2, 3, 4],
       [6, 7, 8, 9]])

In [110]:
a=n1[0].reshape(1,4)

In [111]:
b=n1[1].reshape(1,4)

In [112]:
np.sum(a+b,axis=1)

array([40])

In [113]:
ser1=pd.Series(index=['a','b',2,3])
ser1.name='alpha'
ser1

<ipython-input-113-d6729ab83e3c>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser1=pd.Series(index=['a','b',2,3])

a   NaN
b   NaN
2   NaN
3   NaN
Name: alpha, dtype: float64

In [114]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
A1=list(ser)
A2=[]
for i in range(len(A1)):
    a1=str(A1[i])
    a2=a1[0].upper()
    a3=a1.split(a1[0])
    a4=a2+a3[1]
    A2.append(a4)
print(A2)

['How', 'To', 'Kic', 'Ass?']

In [115]:
ser1=pd.concat([ser,ser,ser],axis=1)
ser1['3']=ser._index
ser1

      0     1     2  3
0   how   how   how  0
1    to    to    to  1
2  kick  kick  kick  2
3  ass?  ass?  ass?  3

In [118]:
np.random.seed(2)
a=pd.Series(np.random.normal(1,4,10))
b=[a.max(),a.median(),c]
c=list(np.percentile(a,[25,75]))
c

NameError: name 'c' is not defined

In [119]:
j=pd.Series([10,20,20,20,20,0,20,30,30,30,0,0,20,20,0])
h=j.value_counts()
h1=h[2:(len(h))]
k1=h[0:2]
for i in range(len(j)):
    if j[i] in h1:
        j[i]='other'
j

0     other
1        20
2        20
3        20
4        20
5         0
6        20
7     other
8     other
9     other
10        0
11        0
12       20
13       20
14        0
dtype: object

In [120]:
DF1

        name  score  attempts qualify
f    Michael   20.0         3    True
j      Jonas   19.0         1    True
c  Katherine   16.5         2    True
d     suresh   15.0         3   False
g    Matthew   14.5         1    True
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
e      Emily    9.0         2   False
i      Kevin    8.0         2   False
h      Laura    NaN         1   False

In [133]:
data.iloc[0:4,1:8]

,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_occupation,contb_receipt_amt,contb_receipt_dt
0,"Obama, Barack","KNOX, JAMES",GADSDEN,AL,RETIRED,50.0,28-Nov-11
1,"Cain, Herman","STOKES, MARION O MR",MARYVILLE,TN,RETIRED,80.0,27-Oct-11
2,"Gingrich, Newt","BLAIR, RALPH E. MR.",GUTHRIE,OK,RETIRED,50.0,07-Dec-11
3,"Obama, Barack","LACEWELL, BARBARA",ROSWELL,GA,COLLISION CENTER MANAGER,10.0,31-Oct-11

In [122]:
z=np.random.randint(5,20,100)

In [123]:
z=z.reshape(10,10)
z

array([[17,  9, 10, 12,  8, 11,  9, 15, 16,  8],
       [12, 11, 15,  6, 15, 17,  8, 10, 13,  9],
       [19, 11,  8, 14,  7,  5,  9, 19, 17,  7],
       [ 9, 15,  6, 12, 19, 13,  7, 18, 15, 14],
       [18, 13, 12,  6, 11, 13, 15, 10, 14, 14],
       [14, 19, 17, 15, 19,  8,  5, 16,  5, 15],
       [ 7, 13, 17, 19, 15, 13,  7, 17, 14, 11],
       [10, 11, 11, 11,  8, 13,  7,  6,  9, 13],
       [ 6, 18, 11, 14, 18, 10,  6,  7,  9, 15],
       [12, 11, 16,  9, 10, 15, 13, 15,  8, 16]])

In [124]:
z[0:4,0:4]

array([[17,  9, 10, 12],
       [12, 11, 15,  6],
       [19, 11,  8, 14],
       [ 9, 15,  6, 12]])

In [148]:
sr='sagar'
sr1=''
for i in sr:
    sr1=i+sr1

In [ ]:
sr1=list(sr)
sr1=sr1[::-1]
''.join(sr1)

In [149]:
sr1

'ragas'

In [154]:
sen=input('enter the sen')
v=['a','e','i','o','u']
u=[x for x in sen if x in v]
u

enter the senthi sis ur daddy bitch ass nigga

['i', 'i', 'u', 'a', 'i', 'a', 'i', 'a']